import academy from "../Images/VAVPVO.jpeg"
import job from "../Images/job1.jpg"
import job2 from "../Images/easyjtag.jpeg"
import admin from "../Images/admin.jpg"
import oneC  from "../Images/oneC.png"
import binance from "../Images/binance.jpg"


export const myData = [
    {
        title: "Создание бота для торговли криптовалютой",
        subheader: "2020 по 2021",
        image: binance,
        imageTitle: 'binance',
        briefContentDescription: 'Работа с API биржи binance для автоматизации торговли',
        description: "Frontend часть бота криптоторговли",
        text: {
            p1: 'Моей задачей в этой истории было создание форм для ввода исходных данных для запуска автоматизированной торговли ' +
                ' на небезизвестной бирже. Работа была оргаинзована двумя людьми, как вы понимаете я был на фронте. Опыта' +
                ' ни я ни мой напарник особого не имели, тем не менее смогли организовать тестовую работу сервиса.',
            p2: 'Закончилась эта история на отсутствии адекватно мыслящих людей среди потенциальных клиентов.' +
                ' Работа сервиса остановлена... Бесценный опыт в программировани и механизмах работы рынка получен)',
            p3: '',
            p4: ''
        }
    },
    {
        title: "Android со всеми прелестями ARM",
        subheader: "Закончил в 2019 году",
        image: job2,
        imageTitle: 'Emmc Flasher',
        briefContentDescription: 'Работа с программным обеспечением на аппаратном уровне',
        description: "Душевное времяпрепровождение для инженера",
        text: {
            p1: 'Паралельная работа наряду с сисемным администрированием: пайка, прошивка, патчи, кряки ' +
                'и конечно же рут права со всеми вытекающими ',
            p2: '',
            p3: '',
            p4: ''
        }
    },
    {
        title: "Системный администратор",
        subheader: "с 2016 по настоящее время",
        image: admin,
        imageTitle: 'fucking cisco',
        briefContentDescription: 'Сети и все что с ними связано',
        description: "ssh, linux, tmux, bash, htop, grep, init.d, systemctl",
        text: {
            p1: 'Работа системным администратором,  если она грамотно налажена становится кладезем времени для' +
                ' самообразования',
            p2: '',
            p3: '',
            p4: ''
        }
    },
    {
        title: "1C  программист",
        subheader: "Начал и окончил",
        image: oneC,
        imageTitle: '1С',
        briefContentDescription: 'Программирование на русском',
        description: "Опыт как опыт",
        text: {
            p1: 'Попробовать определенно стоило... Обновление конфигураций,  язык запросов,  ' +
                'написание обработок и печатных форм',
            p2: 'Вобщем по мере понимания что происходит уходит желание лезть в эту тему дальше со' +
                ' всеми вытекающими последствиями',
            p3: '',
            p4: ''
        }
    },
    {
        title: "Образование",
        subheader: "окончил в 2010 году",
        image: academy,
        imageTitle: 'militaryAcademy',
        briefContentDescription: 'Военная Академмия войсковой Противовоздушной Обороны',
        description: "Высшее инженер по специальности радиотехника",
        text: {
            p1: 'Данное учебное заведение обучает инженеров по специальности "Радиотехника", имеет ' +
                'огромную  материально- учебную  базу и дает фундаментальные знания  в области построения' +
                'как цифровых  так и аналоговых электронных систем',
            p2: '',
            p3: '',
            p4: ''
        }
    },
    {
        title: "Служба в Вооруженных Силах",
        subheader: "с 2010 по 2015",
        image: job,
        imageTitle: 'TOR-M1',
        briefContentDescription: 'Долг перед Родиной',
        description: "служба начальником зенитного ракетного расчета",
        text: {
            p1: 'Обслуживание и настройка радиолокационной аппаратуры',
            p2: '',
            p3: '',
            p4: ''
        }
    },

]